<h1>TECHNOHACKS EDUTECH

<h2>Data analytics
Internship

<h3>Task 4:Pivote Table

In [46]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [47]:
df=pd.read_csv("C:/Users/mohan/Desktop/Data analytics Internship/dataset/train.csv")
df.shape

(891, 12)

In [48]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
df['Survived'].mean()

0.3838383838383838

In [50]:
df.groupby('Pclass')['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [51]:
df.pivot_table(index='Age',columns='Sex',values='Survived').dropna(thresh=1)

Sex    female  male
Age
0.42      NaN   1.0
0.67      NaN   1.0
0.75      1.0   NaN
0.83      NaN   1.0
0.92      NaN   1.0
...       ...   ...
70.00     NaN   0.0
70.50     NaN   0.0
71.00     NaN   0.0
74.00     NaN   0.0
80.00     NaN   1.0

[88 rows x 2 columns]

<h4>Task Completed